<template>
  <div class="HeaderWrapper" @click.stop>
    <nav class="HeaderNav">
      <div>
        <svg
          width="80"
          height="18"
          viewBox="0 0 80 18"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M8.56953 1.71362C8.56953 0.924633 9.20912 0.285034 9.99811 0.285034C10.7871 0.285034 11.4267 0.924631 11.4267 1.71361V12.1334C11.428 12.1836 11.4286 12.2339 11.4286 12.2843C11.4286 15.4403 8.87025 17.9986 5.71432 17.9986C2.55839 17.9986 0 15.4403 0 12.2843C0 9.12839 2.55839 6.57 5.71432 6.57C6.75434 6.57 7.72947 6.84784 8.56953 7.33335V1.71362ZM5.71443 15.1423C7.2924 15.1423 8.57159 13.8631 8.57159 12.2852C8.57159 10.7072 7.2924 9.428 5.71443 9.428C4.13647 9.428 2.85727 10.7072 2.85727 12.2852C2.85727 13.8631 4.13647 15.1423 5.71443 15.1423Z"
            fill="white"
          />
          <path
            opacity="0.8"
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M7.1455 2.14197C6.35652 2.14197 5.71692 2.78157 5.71692 3.57055V9.42675C7.29483 9.42681 8.57397 10.706 8.57397 12.2839C8.57397 12.2842 8.57397 12.2846 8.57397 12.2849H8.57408V3.57055C8.57408 2.78156 7.93448 2.14197 7.1455 2.14197Z"
            fill="white"
          />
          <path
            opacity="0.5"
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M4.28307 3.85645C3.49409 3.85645 2.85449 4.49604 2.85449 5.28503V12.2851C2.85467 10.7073 4.1338 9.42824 5.71165 9.42824V5.28503C5.71165 4.49604 5.07206 3.85645 4.28307 3.85645Z"
            fill="white"
          />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M41.5541 17.9998C39.925 17.9998 38.5997 17.4916 37.5784 16.4751C36.5815 15.4344 36.083 14.0549 36.083 12.3366C36.083 10.6183 36.5693 9.26297 37.542 8.2707C38.5389 7.25422 39.8399 6.74598 41.4447 6.74598C42.5876 6.74598 43.5846 7.14531 44.4356 7.94397C44.5329 7.65355 44.7153 7.41153 44.9827 7.21792C45.2502 7.0243 45.5663 6.9275 45.9311 6.9275C46.4174 6.9275 46.8065 7.07271 47.0983 7.36313C47.4144 7.62935 47.5724 7.95607 47.5724 8.3433V16.584C47.5724 16.9955 47.4144 17.3343 47.0983 17.6005C46.8065 17.8667 46.4174 17.9998 45.9311 17.9998C45.1286 17.9998 44.6302 17.6489 44.4356 16.9471C43.6575 17.6489 42.697 17.9998 41.5541 17.9998ZM43.6697 14.297C43.2077 14.8052 42.5876 15.0593 41.8095 15.0593C41.0557 15.0593 40.4356 14.8052 39.9493 14.297C39.4873 13.7645 39.2563 13.1111 39.2563 12.3366C39.2563 11.5379 39.4873 10.8966 39.9493 10.4126C40.4356 9.92852 41.0557 9.6865 41.8095 9.6865C42.5876 9.6865 43.2077 9.92852 43.6697 10.4126C44.1317 10.8966 44.3627 11.5379 44.3627 12.3366C44.3627 13.1111 44.1317 13.7645 43.6697 14.297Z"
            fill="white"
          />
          <path
            d="M32.0751 17.9998C31.0295 17.9998 30.1663 17.6973 29.4854 17.0923C28.8045 16.4872 28.4641 15.5554 28.4641 14.297V10.3763C28.4641 10.1342 28.3425 10.0132 28.0994 10.0132H27.5523C27.1146 10.0132 26.7863 9.88012 26.5675 9.6139C26.3486 9.34768 26.2392 9.00885 26.2392 8.59742C26.2392 8.16179 26.3486 7.81086 26.5675 7.54464C26.7863 7.25422 27.1146 7.10901 27.5523 7.10901H28.0994C28.3425 7.10901 28.4641 6.988 28.4641 6.74598V4.05958C28.4641 3.64815 28.61 3.29722 28.9018 3.0068C29.1936 2.71638 29.5705 2.57117 30.0325 2.57117C30.4945 2.57117 30.8714 2.71638 31.1632 3.0068C31.4793 3.27302 31.6374 3.62395 31.6374 4.05958V6.74598C31.6374 6.988 31.759 7.10901 32.0021 7.10901H33.3517C33.7651 7.10901 34.1055 7.25422 34.373 7.54464C34.6648 7.83507 34.8107 8.18599 34.8107 8.59742C34.8107 9.00885 34.6648 9.34768 34.373 9.6139C34.1055 9.88012 33.7529 10.0132 33.3152 10.0132H32.0021C31.759 10.0132 31.6374 10.1342 31.6374 10.3763V13.7887C31.6374 14.2243 31.7103 14.5269 31.8562 14.6963C32.0265 14.8657 32.2331 14.9504 32.4763 14.9504C32.5736 14.9504 32.7681 14.9262 33.0599 14.8778C33.3517 14.8052 33.5341 14.7689 33.607 14.7689C33.9961 14.7689 34.3243 14.9141 34.5918 15.2045C34.8593 15.4949 34.993 15.8459 34.993 16.2573C34.993 16.5719 34.8958 16.8623 34.7012 17.1286C34.531 17.3948 34.2514 17.5884 33.8623 17.7094C33.5462 17.8062 33.2423 17.8788 32.9505 17.9272C32.6587 17.9756 32.3669 17.9998 32.0751 17.9998Z"
            fill="white"
          />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M18.7577 17.9998C17.1285 17.9998 15.8032 17.4916 14.7819 16.4751C13.785 15.4344 13.2865 14.0549 13.2865 12.3366C13.2865 10.6183 13.7728 9.26297 14.7455 8.2707C15.7424 7.25422 17.0434 6.74598 18.6482 6.74598C19.7911 6.74598 20.7881 7.14531 21.6391 7.94397C21.7364 7.65355 21.9188 7.41153 22.1862 7.21792C22.4537 7.0243 22.7698 6.9275 23.1346 6.9275C23.6209 6.9275 24.01 7.07271 24.3018 7.36313C24.6179 7.62935 24.7759 7.95607 24.7759 8.3433V16.584C24.7759 16.9955 24.6179 17.3343 24.3018 17.6005C24.01 17.8667 23.6209 17.9998 23.1346 17.9998C22.3321 17.9998 21.8337 17.6489 21.6391 16.9471C20.861 17.6489 19.9005 17.9998 18.7577 17.9998ZM20.8732 14.297C20.4112 14.8052 19.7911 15.0593 19.013 15.0593C18.2592 15.0593 17.6391 14.8052 17.1528 14.297C16.6908 13.7645 16.4598 13.1111 16.4598 12.3366C16.4598 11.5379 16.6908 10.8966 17.1528 10.4126C17.6391 9.92852 18.2592 9.6865 19.013 9.6865C19.7911 9.6865 20.4112 9.92852 20.8732 10.4126C21.3352 10.8966 21.5662 11.5379 21.5662 12.3366C21.5662 13.1111 21.3352 13.7645 20.8732 14.297Z"
            fill="white"
          />
          <path
            d="M62.9032 0.438408H65.9415L69.1633 17.847H66.4921L66.0129 14.7282H62.8318L62.373 17.847H59.6916L62.9032 0.438408ZM65.707 12.7406L64.4835 4.0669H64.3714L63.1377 12.7406H65.707Z"
            fill="white"
          />
          <path
            d="M70.9646 0.438408H73.7072C74.1218 0.438408 74.55 0.451998 74.9918 0.479178C75.4405 0.499563 75.8755 0.57091 76.2969 0.693218C76.7251 0.815527 77.1261 1.00579 77.5 1.26399C77.8806 1.51541 78.2137 1.87214 78.4991 2.33419C78.7846 2.78946 79.0089 3.36702 79.1721 4.0669C79.342 4.75999 79.4269 5.60935 79.4269 6.615V11.6704C79.4269 12.6761 79.342 13.5288 79.1721 14.2287C79.0089 14.9286 78.7846 15.5062 78.4991 15.9614C78.2137 16.4167 77.8806 16.7734 77.5 17.0316C77.1261 17.283 76.7251 17.4699 76.2969 17.5922C75.8755 17.7145 75.4405 17.7893 74.9918 17.8165C74.55 17.8368 74.1218 17.847 73.7072 17.847H70.9646V0.438408ZM74.2781 16.0022C74.7539 16.0022 75.1448 15.941 75.4506 15.8187C75.7633 15.6964 76.008 15.4824 76.1847 15.1766C76.3683 14.8641 76.494 14.4428 76.562 13.9128C76.6299 13.376 76.6639 12.6999 76.6639 11.8845V6.4825C76.6639 5.66711 76.6299 4.99441 76.562 4.46441C76.494 3.92761 76.3683 3.50632 76.1847 3.20055C76.008 2.88798 75.7633 2.67054 75.4506 2.54824C75.1448 2.42593 74.7539 2.36477 74.2781 2.36477H73.6052V16.0022H74.2781Z"
            fill="white"
          />
          <path
            d="M55.0865 17.9999C54.8147 17.9999 54.519 17.9761 54.1995 17.9286C53.8869 17.8878 53.5708 17.7961 53.2513 17.6534C52.9387 17.5107 52.6362 17.3102 52.3439 17.052C52.0584 16.787 51.8035 16.4405 51.5792 16.0124C51.3617 15.5843 51.185 15.0577 51.0491 14.4326C50.9199 13.8006 50.8553 13.0498 50.8553 12.1801V6.01365C50.8553 5.1371 50.9233 4.38966 51.0593 3.77132C51.1952 3.14619 51.3753 2.62298 51.5996 2.20169C51.8239 1.77361 52.0822 1.43387 52.3745 1.18245C52.6668 0.931041 52.9692 0.740783 53.2819 0.611679C53.5946 0.475781 53.9038 0.387446 54.2097 0.346677C54.5224 0.305907 54.8113 0.285522 55.0763 0.285522C55.7696 0.285522 56.3474 0.384049 56.8096 0.581102C57.2786 0.77136 57.6524 1.03636 57.9311 1.37611C58.2166 1.70906 58.4171 2.09977 58.5327 2.54824C58.6732 2.87801 58.9231 4.04093 58.7978 6.05442H56.3814L56.3508 5.16768C56.3508 4.2096 56.2454 3.49273 56.0347 3.01709C55.824 2.54144 55.5148 2.30362 55.1069 2.30362C54.8622 2.30362 54.6481 2.35118 54.4646 2.44631C54.2811 2.54144 54.1281 2.70452 54.0058 2.93555C53.8835 3.15978 53.7883 3.45876 53.7203 3.83248C53.6591 4.2062 53.6286 4.67165 53.6286 5.22884V13.1789C53.6286 13.7225 53.6524 14.1744 53.6999 14.5345C53.7543 14.8946 53.8393 15.1834 53.9548 15.4009C54.0704 15.6183 54.2199 15.7746 54.4034 15.8697C54.5938 15.958 54.8215 16.0022 55.0865 16.0022C55.2565 16.0022 55.4196 15.9648 55.5759 15.8901C55.7323 15.8085 55.8682 15.6862 55.9838 15.5232C56.1061 15.3533 56.2013 15.1426 56.2692 14.8912C56.344 14.633 56.3814 14.3307 56.3814 13.9841V12.282H58.7978V13.8924C58.7978 15.2921 58.4783 16.325 57.8394 16.9909C57.2004 17.6568 56.2828 17.9931 55.0865 17.9999Z"
            fill="white"
          />
        </svg>
      </div>
      <div class="HeaderNavItem">Дашборды</div>
      <div class="HeaderNavItem">Помощь</div>
    </nav>

    <div class="HeaderNavRight">
      <button class="IconNotification">
        <svg 
          width="18"
          height="18"
          viewBox="0 0 18 18"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M9 16.5C8.17204 16.4959 7.50069 15.8279 7.4925 15H10.4925C10.4941 15.2005 10.4558 15.3994 10.38 15.585C10.1832 16.0365 9.78136 16.3658 9.3 16.47H9.29625H9.285H9.2715H9.26475C9.17761 16.4881 9.08899 16.4982 9 16.5ZM15 14.25H3V12.75L4.5 12V7.875C4.46049 6.81684 4.69945 5.76684 5.193 4.83C5.68428 3.96113 6.52402 3.34416 7.5 3.135V1.5H10.5V3.135C12.4342 3.5955 13.5 5.2785 13.5 7.875V12L15 12.75V14.25Z"
            fill="white"
          />
        </svg>
      </button>
      <base-dropdown 
        class="DropdownSelect"
        alignment="right"
      >
        <span 
          class="DropdownUsername" 
          slot="toggle-btn"
        >
          <div class="IconUser" style="background-image: url(https://playcontestofchampions.com/wp-content/uploads/2021/11/champion-iron-man-infinity-war-720x720.jpg);"></div>
          <div class="UsernameWrapper">Username</div>
        </span>
        <nav class="NavList type_dropdown">
          <a class="NavItem">
            <svg 
              width="20" 
              height="20" 
              viewBox="0 0 20 20" 
              fill="none" 
              xmlns="http://www.w3.org/2000/svg"
            >
              <path 
                d="M5.83301 6.66667C5.83301 4.36548 7.69849 2.5 9.99967 2.5C12.3009 2.5 14.1663 4.36548 14.1663 6.66667C14.1663 8.96785 12.3009 10.8333 9.99967 10.8333C7.69849 10.8333 5.83301 8.96785 5.83301 6.66667ZM9.99967 9.16667C11.3804 9.16667 12.4997 8.04738 12.4997 6.66667C12.4997 5.28595 11.3804 4.16667 9.99967 4.16667C8.61896 4.16667 7.49967 5.28595 7.49967 6.66667C7.49967 8.04738 8.61896 9.16667 9.99967 9.16667Z" 
                fill="#17569B"
              />
              <path 
                d="M5.28563 13.6193C4.03539 14.8695 3.33301 16.5652 3.33301 18.3333H4.99967C4.99967 17.0073 5.52646 15.7355 6.46414 14.7978C7.40182 13.8601 8.67359 13.3333 9.99967 13.3333C11.3258 13.3333 12.5975 13.8601 13.5352 14.7978C14.4729 15.7355 14.9997 17.0073 14.9997 18.3333H16.6663C16.6663 16.5652 15.964 14.8695 14.7137 13.6193C13.4635 12.369 11.7678 11.6667 9.99967 11.6667C8.23156 11.6667 6.53587 12.369 5.28563 13.6193Z" 
                fill="#17569B"
              />
            </svg>
            <span class="Text">Профиль</span>
          </a>
          <a class="NavItem">
            <svg 
              width="20" 
              height="20" 
              iewBox="0 0 20 20" 
              fill="none" 
              xmlns="http://www.w3.org/2000/svg"
            >
              <path 
                d="M5.83301 6.66667C5.83301 4.36548 7.69849 2.5 9.99967 2.5C12.3009 2.5 14.1663 4.36548 14.1663 6.66667C14.1663 8.96785 12.3009 10.8333 9.99967 10.8333C7.69849 10.8333 5.83301 8.96785 5.83301 6.66667ZM9.99967 9.16667C11.3804 9.16667 12.4997 8.04738 12.4997 6.66667C12.4997 5.28595 11.3804 4.16667 9.99967 4.16667C8.61896 4.16667 7.49967 5.28595 7.49967 6.66667C7.49967 8.04738 8.61896 9.16667 9.99967 9.16667Z" 
                fill="#17569B"/>
              <path 
                d="M5.28563 13.6193C4.03539 14.8695 3.33301 16.5652 3.33301 18.3333H4.99967C4.99967 17.0073 5.52646 15.7355 6.46414 14.7978C7.40182 13.8601 8.67359 13.3333 9.99967 13.3333C11.3258 13.3333 12.5975 13.8601 13.5352 14.7978C14.4729 15.7355 14.9997 17.0073 14.9997 18.3333H16.6663C16.6663 16.5652 15.964 14.8695 14.7137 13.6193C13.4635 12.369 11.7678 11.6667 9.99967 11.6667C8.23156 11.6667 6.53587 12.369 5.28563 13.6193Z" 
                fill="#17569B"/>
              <path 
                fill-rule="evenodd" 
                clip-rule="evenodd" 
                d="M14.4801 7.50001H14.7922C14.9535 7.49988 15.093 7.39089 15.1275 7.23801L15.2694 6.61168C15.3647 6.57105 15.4576 6.52531 15.5477 6.47468C15.6335 6.4263 15.7165 6.37344 15.7964 6.31634L16.4279 6.51134C16.5817 6.55879 16.7488 6.49596 16.8295 6.36034L17.4548 5.30934C17.5346 5.17352 17.5071 5.00217 17.3885 4.89634L16.8989 4.46301C16.9212 4.26671 16.9212 4.06864 16.8989 3.87234L17.3885 3.43901C17.5071 3.33318 17.5346 3.16184 17.4548 3.02601L16.8295 1.97501C16.7488 1.8394 16.5817 1.77657 16.4279 1.82401L15.7964 2.01901C15.7175 1.96246 15.6354 1.91027 15.5504 1.86268C15.4595 1.81104 15.3655 1.76452 15.2691 1.72334L15.1275 1.09568C15.0931 0.942666 14.9536 0.833508 14.7922 0.833344H13.5417C13.3802 0.833508 13.2407 0.942666 13.2063 1.09568L13.0662 1.72301C12.9748 1.76129 12.8856 1.80424 12.7989 1.85168C12.7086 1.90242 12.6213 1.95806 12.5374 2.01834L11.9063 1.82334C11.7524 1.77572 11.5851 1.83858 11.5043 1.97434L11.3096 2.30174C11.9851 2.50408 12.5948 2.85897 13.0985 3.32641C13.3505 3.02557 13.7349 2.83334 14.1656 2.83334C14.9245 2.83334 15.5398 3.4303 15.5398 4.16668C15.5398 4.82542 15.0474 5.37259 14.4002 5.48064C14.5019 5.8588 14.5562 6.25639 14.5562 6.66665C14.5562 6.95129 14.5301 7.22983 14.4801 7.50001Z" 
                fill="#17569B"/>
            </svg>
            <span class="Text">Панель администратора</span>
          </a>
          <a class="NavItem">
            <svg 
              width="20" 
              height="20" 
              viewBox="0 0 20 20" 
              fill="none" 
              xmlns="http://www.w3.org/2000/svg">
              <path 
                d="M4.16667 2.5L11.6667 2.5C12.5871 2.5 13.3333 3.24619 13.3333 4.16667L13.3333 7.5L11.6667 7.5L11.6667 4.16667L4.16667 4.16666L4.16667 15.8333L11.6667 15.8333L11.6667 12.5L13.3333 12.5L13.3333 15.8333C13.3333 16.7538 12.5871 17.5 11.6667 17.5L4.16667 17.5C3.24619 17.5 2.5 16.7538 2.5 15.8333L2.5 4.16666C2.5 3.24619 3.24619 2.5 4.16667 2.5ZM10 6.66667L10 9.16667L17.5 9.16667L17.5 10.8333L10 10.8333L10 13.3333L5.83333 10L10 6.66667Z" 
                fill="#17569B"/>
            </svg>
            <span class="Text">Выход</span>
          </a>
        </nav> 
      </base-dropdown>
      <div 
        class="BurgerButton" 
        @click="changeVisibility()" 
        :class="{ 'active': burgerVisibility }"
      >
        <span class="BurgerBar"></span>
        <span class="BurgerBar"></span>
        <span class="BurgerBar"></span>
      </div>
      <nav 
        class="MenuWrapper" 
        :class="{ 'open': burgerVisibility }" 
      >
        <div class="Menu">
          <div class="MenuUserData">
            <div class="MenuUserPhoto" style="background-image: url(https://playcontestofchampions.com/wp-content/uploads/2021/11/champion-iron-man-infinity-war-720x720.jpg);"></div>
            <div>
              <span class="MenuUserPosition">Администратор</span>
              <p class="MenuUsername">Георгий Арановский</p>
            </div> 
          </div>
          <ul class="MenuList">
            <li class="MenuListItem"><a class="MenuLink" href="#">Профиль</a></li>
            <li class="MenuListItem"><a class="MenuLink" href="#">Панель администратора</a></li>
          </ul>
          <button 
            @click="changeVisibility()" 
            class="ButtonBack"
          >
            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M4.16667 2.5L11.6667 2.5C12.5871 2.5 13.3333 3.24619 13.3333 4.16667L13.3333 7.5L11.6667 7.5L11.6667 4.16667L4.16667 4.16666L4.16667 15.8333L11.6667 15.8333L11.6667 12.5L13.3333 12.5L13.3333 15.8333C13.3333 16.7538 12.5871 17.5 11.6667 17.5L4.16667 17.5C3.24619 17.5 2.5 16.7538 2.5 15.8333L2.5 4.16666C2.5 3.24619 3.24619 2.5 4.16667 2.5ZM10 6.66667L10 9.16667L17.5 9.16667L17.5 10.8333L10 10.8333L10 13.3333L5.83333 10L10 6.66667Z" fill="white"/>
            </svg>
            <span class="Text">Выход</span>
          </button>
        </div>
      </nav>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      burgerVisibility: false,
    }
  },
  methods: {
    async logout() {
      await Application.getSystem('AuthSystem', '0.1.0').logout();
      Application.getSystem('RouteSystem', '0.1.0').navigate('/login');
    },
    changeVisibility() {
      this.burgerVisibility = !this.burgerVisibility;
    },
  },
};
</script>

<style lang="scss" scoped>

.HeaderWrapper {
  background-color: #272a3a;
  color: var(--general_white);
  width: 100vw;
  display: flex;
  justify-content: space-between;
  padding: 0 20px;
  height: 30px;
  font-family: 'Proxima Nova';

  &,
  *,
  *::after,
  *::before {
    box-sizing: border-box;
  }  

  .HeaderNav {
    display: flex;
    align-items: center;
    column-gap: 30px;
    margin-right: 10%;
  }

  .HeaderNavItem {
    font-size: 13px;
    cursor: pointer;

    @media (max-width: 576px) {
      display: none
    }      
  }

  .HeaderNavRight {
    display: flex;
    align-items: center;

    .IconNotification {
      display: flex;
      cursor: pointer;
      border: none;
      background-color: transparent;
      padding: 0;
      margin-right: 30px;

      @media (max-width: 576px) {
        margin-right: 16px;
      }
    }

    .IconUser {
      cursor: pointer;
      min-width: 18px;
      border-radius: 50%;
      display: flex;
      margin-right: 6px;

      @media (max-width: 576px) {
        display: none;
      }
    }

    .DropdownSelect {
      fill: var(--header_content);
      display: contents;

      & > * {
        cursor: pointer;
      }

      @media (max-width: 576px) {
        display: none
      }    
    }

    .UsernameWrapper {
      text-overflow: ellipsis;
      overflow: hidden;
      max-width: 150px;
      white-space: nowrap;
    }

    .DropdownUsername {
      display: flex;
      align-items: center;
      font-size: 13px;
      font-weight: 600;
      margin-right: 9px;
      color: var(--header_content);
    }

    .NavList {

      &.type_dropdown {
        background-color: var(--background_main);
        border: 1px solid var(--border);
        display: flex;
        flex-direction: column;
        box-shadow: 1px 1px 2px rgba(8, 18, 55, 0.12), 0px 4px 12px rgba(8, 18, 55, 0.12);
        border-radius: 8px;
        padding: 16px;

        svg {
          path {
            fill: var(--accent);
          }
        }
          
        .NavItem {
          padding-bottom: 8px;
          display: flex;
          font-size: 14px;
          line-height: 1.58;
          color: var(--text_main);
          cursor: pointer;

          &:hover {
            color: var(--button_primary);
          }

          &:last-child {
            padding-bottom: 0;
          }
        }
      }
    }

    .Text {
      padding-left: 8px;
    } 

    .BurgerButton {
      display: flex;
      flex-direction: column;
      justify-content: center;
      align-items: center;
      width: 18px;
      height: 18px;
      gap: 1.8px;
      cursor: pointer;

      @media not screen and (max-width: 576px) {
        display: none
      } 

      .BurgerBar {
        width: 13.5px;
        height: 1.8px;
        background-color: #fff;
        transition: all ease .2s;
      }

      &.active .BurgerBar:nth-of-type(1) {
        transform: translateY(3.2px) rotate(-45deg);
      }

      &.active .BurgerBar:nth-of-type(2) {
        opacity: 0;
      }

      &.active .BurgerBar:nth-of-type(3) {
        transform: translateY(-4px) rotate(45deg);
      }
    }

    .MenuWrapper {
      height: 100%;
      width: 100%;
      position: fixed;
      right: 0;
      top: 30px;
      display: none;
      z-index: 10;
      background-color: var(--accent);
      overflow-y: auto;

      &.open {
        display: block;


        @media (min-width: 576px) {
          display: none;
        } 
      }
    }

    .Menu {
      display: flex;
      flex-direction: column;
      min-height: 100%;
    }

    .MenuList {
      list-style: none;
      height: 100%;
      padding: 58px 20px 0;
      margin: 0;
      margin-bottom: 58px;
    }

    .MenuListItem {
      width: 100%;
      display: block;
      margin: 0 auto;
      padding-bottom: 24px;

      &:last-child {
        padding-bottom: 0;
      }
    }

    .MenuLink {
      display: inline-block;
      text-decoration: none;
      font-size: 17px;
      font-weight: 700;
      line-height: 1.3;
      color: var(--general_white);

      &:hover {
        color: var(--border);
      }
    }

    .MenuUserData {
      background-color: #2C67A6;
      padding: 20px 30px;
      display: flex;
      align-items: center;
    }

    .MenuUserPhoto {
      display: flex;
      max-width: 50px;
      border-radius: 8px;
      background-color: var(--button_primary_24);
      margin-right: 13px;
      width: 100%;
    }

    .IconUser,
    .MenuUserPhoto {
      position: relative;
      overflow: hidden;
      background-repeat: no-repeat;
      background-size: cover;
      background-position: center;

      &::before {
        content: '';
        display: block;
        padding-top: 100%;
        float: left;
      }

      &::after {
        content: '';
        display: block;
        clear: both;
      }
    }

    .MenuUserPosition {
      font-size: 14px;
      color: var(--border);
    }

    .MenuUsername {
      margin: 0;
      font-size: 20px;
      color: var(--general_white);
      line-height: 1.19;
    }

    .ButtonBack {
      border: none;
      background-color: transparent;
      display: flex;
      cursor: pointer;
      font-weight: 700;
      font-size: 17px;
      align-items: center;
      color: var(--general_white);
      margin: auto auto 63px 30px;
      font-family: 'Proxima Nova';
      padding: 0;

      svg {
        path {
          fill: var(--general_white);
        }
      }

      &:hover {
        color: var(--border);

        svg {
          path {
            fill: var(--border);
          }
        }
      }
    }
  }
}
</style>